Revit 2027 API
BuiltInFailures.MassFailures.NoSolidInMass Property
 Mass contains no solid geometry. Mass Floors, volume, and surface area, won't be computed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoSolidInMass { get; }
Public Shared ReadOnly Property NoSolidInMass As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoSolidInMass {
	FailureDefinitionId^ get ();
}
static member NoSolidInMass : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MassFailures Class
Autodesk.Revit.DB Namespace